app/views/pages/list.html.erb

      <td class="center"><%= status_tag(page.visible) %></td>
      <td class="center"><%= link_to(page.sections.size, {:controller => 'sections', :action => 'list', :page_id => page.id}) %></td>
---
SELECT COUNT(*) FROM "sections" WHERE ("sections".page_id = 1)