app/views/subjects/list.html.erb

SELECT COUNT(*) FROM "pages" WHERE ("pages".subject_id = 1)
---
      <td class="center"><%= status_tag(subject.visible) %></td>
      <td class="center"><%= link_to(subject.pages.size, {:controller => 'pages', :action => 'list', :subject_id => subject.id}) %></td>