app/controllers/pages_controller.rb

  def list
    @pages = Page.sorted.where(:subject_id => @subject.id)
---
SELECT "pages".* FROM "pages" WHERE "pages"."subject_id" = 1 ORDER BY pages.position ASC

  def new
    @page = Page.new(:subject_id => @subject.id)
    @page_count = @subject.pages.size + 1
    @subjects = Subject.order('position ASC')
---
SELECT COUNT(*) FROM "pages" WHERE ("pages".subject_id = 1)
SELECT "subjects".* FROM "subjects" ORDER BY position ASC

  def create
    new_position = params[:page].delete(:position)
    # Instantiate a new object using form parameters
    @page = Page.new(params[:page])
    # Save the object
    if @page.save
      @page.move_to_position(new_position)
      # If save succeeds, redirect to the list action
      flash[:notice] = "Seite erstellt."
      redirect_to(:action => 'list', :subject_id => @page.subject_id)
    else
      # If save fails, redisplay the form so user can fix problems
      @page_count = @subject.pages.size + 1
---
INSERT INTO "pages" ("visible", "updated_at", "subject_id", "created_at", "name", "permalink", "position") VALUES ('t', '2011-02-23 16:21:52.499127', 1, '2011-02-23 16:21:52.499127', 'Test Seite', 'test', NULL)
SELECT "pages".* FROM "pages" WHERE (position >= 1 AND position <= 1000000 AND pages.subject_id = 1)
SELECT COUNT(*) FROM "pages" WHERE (pages.subject_id = 1)

  def edit
    @page = Page.find(params[:id])
    @page_count = @subject.pages.size
    @subjects = Subject.order('position ASC')
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "pages" WHERE ("pages".subject_id = 1)
SELECT "subjects".* FROM "subjects" ORDER BY position ASC

  def update
    new_position = params[:page].delete(:position)
    # Find object using form parameters
    @page = Page.find(params[:id])
    # Update the object
    if @page.update_attributes(params[:page])
      @page.move_to_position(new_position)
      # If update succeeds, redirect to the list action
      flash[:notice] = "Seite geändert."
      redirect_to(:action => 'list', :id => @page.id, :subject_id => @page.subject_id)
    else
      # If save fails, redisplay the form so user can fix problems
      @page_count = @subject.pages.size
      @subjects = Subject.order('position ASC')
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "pages" WHERE ("pages".subject_id = 1)
SELECT "subjects".* FROM "subjects" ORDER BY position ASC

  def find_subject
    if params[:subject_id]
      @subject = Subject.find_by_id(params[:subject_id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 1 LIMIT 1