app/controllers/public_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."permalink" = 'test' AND "pages"."visible" = 't' LIMIT 1
---
  def show
    @page = Page.where(:permalink => params[:id], :visible => true).first