app/controllers/sections_controller.rb

  def list
    @sections = Section.sorted.where(:page_id => @page.id)
---
SELECT "sections".* FROM "sections" WHERE "sections"."page_id" = 1 ORDER BY sections.position ASC

  def show
    @section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 LIMIT 1

  def new
    @section = Section.new(:page_id => @page.id)
    @section_count = @page.sections.size + 1
    @pages = Page.order('position ASC')
---
SELECT COUNT(*) FROM "sections" WHERE ("sections".page_id = 1)
SELECT "pages".* FROM "pages" ORDER BY position ASC

  def create
    new_position = params[:section].delete(:position)
    @section = Section.new(params[:section])
    if @section.save
      @section.move_to_position(new_position)
      flash[:notice] = "Sektion erstellt."
      redirect_to(:action => 'list', :page_id => @section.page_id)
    else
      @section_count = @page.sections.size + 1
---
INSERT INTO "sections" ("content", "created_at", "name", "page_id", "position", "visible", "updated_at", "content_type") VALUES ('Hallo zusammen', '2011-02-23 16:22:13.504232', 'Begrüßung', 1, NULL, 't', '2011-02-23 16:22:13.504232', 'text')
SELECT "sections".* FROM "sections" WHERE (position >= 1 AND position <= 1000000 AND sections.page_id = 1)
SELECT COUNT(*) FROM "sections" WHERE (sections.page_id = 1)

  def edit
    @section = Section.find(params[:id])
    @section_count = @page.sections.size
    @pages = Page.order('position ASC')
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "sections" WHERE ("sections".page_id = 1)
SELECT "pages".* FROM "pages" ORDER BY position ASC

  def delete
    @section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 2 LIMIT 1

  def destroy
    section = Section.find(params[:id])
    section.move_to_position(nil)
    section.destroy
---
SELECT "sections".* FROM "sections" WHERE (position >= 3 AND position <= 1000000 AND sections.page_id = 1)
DELETE FROM "sections" WHERE "sections"."id" = 2

  def find_page
    if params[:page_id]
      @page = Page.find_by_id(params[:page_id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 1 LIMIT 1