app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects" ORDER BY subjects.position ASC
---
  def list
    @subjects = Subject.order("subjects.position ASC")

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 1 LIMIT 1
---
  def show
    @subject = Subject.find(params[:id])

SELECT COUNT(*) FROM "subjects"
---
  def new
    @subject = Subject.new
    @subject_count = Subject.count + 1

INSERT INTO "subjects" ("created_at", "name", "visible", "updated_at", "position") VALUES ('2011-02-23 16:25:00.000000', 'lösch mich', 't', '2011-02-23 16:25:06.774508', NULL)
SELECT COUNT(*) FROM "subjects" WHERE (1=1)
---
  def create
    new_position = params[:subject].delete(:position)
    # Instantiate a new object using form parameters
    @subject = Subject.new(params[:subject])
    # Save the object
    if @subject.save
      @subject.move_to_position(new_position)
      # If save succeeds, redirect to the list action
      flash[:notice] = "Rubrik erstellt."
      redirect_to(:action => 'list')
    else
      # If save fails, redisplay the form so user can fix problems
      @subject_count = Subject.count + 1

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "subjects"
---
  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 1 LIMIT 1
UPDATE "subjects" SET "updated_at" = '2011-02-23 16:24:56.500436', "name" = 'Tests' WHERE "subjects"."id" = 1
SELECT COUNT(*) FROM "subjects" WHERE (1=1)
---
  def update
    new_position = params[:subject].delete(:position)
    # Find object using form parameters
    @subject = Subject.find(params[:id])
    # Update the object
    if @subject.update_attributes(params[:subject])
      @subject.move_to_position(new_position)
      # If update succeeds, redirect to the list action
      flash[:notice] = "Rubrik geändert."
      redirect_to(:action => 'list', :id => @subject.id)
    else
      # If save fails, redisplay the form so user can fix problems
      @subject_count = Subject.count

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 2 LIMIT 1
---
  def delete
    @subject = Subject.find(params[:id])

SELECT "subjects".* FROM "subjects" WHERE (position >= 3 AND position <= 1000000 AND 1=1)
DELETE FROM "subjects" WHERE "subjects"."id" = 2
---
  def destroy
    subject = Subject.find(params[:id])
    subject.move_to_position(nil)
    subject.destroy