app/views/public/show.html.erb


<% @page.sections.visible.sorted.each do |section| %>
---
SELECT "sections".* FROM "sections" WHERE "sections"."visible" = 't' AND ("sections".page_id = 2) ORDER BY sections.position ASC