app/views/layouts/_navigation.html.erb

SELECT "pages".* FROM "pages" WHERE "pages"."visible" = 't' AND ("pages".subject_id = 1) ORDER BY pages.position ASC
SELECT COUNT(*) FROM "pages" WHERE ("pages".subject_id = 1)
---
    <ul>
    <% subject.pages.visible.sorted.each do |page| %>